MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMG55J19B/mcu.h
#define ID_PERIPH_COUNT ( 50) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup SAMG55J19_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAMG55J19 */
/* ************************************************************************** */
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define ADC                    (0x40038000)                   /**< \brief (ADC       ) Base Address */
#define CHIPID                 (0x400E0740)                   /**< \brief (CHIPID    ) Base Address */
#define CMCC                   (0x4003C000)                   /**< \brief (CMCC      ) Base Address */
#define CRCCU                  (0x40048000)                   /**< \brief (CRCCU     ) Base Address */
#define EFC                    (0x400E0A00)                   /**< \brief (EFC       ) Base Address */
#define FLEXCOM0               (0x4000C000)                   /**< \brief (FLEXCOM0  ) Base Address */
#define FLEXCOM1               (0x40020000)                   /**< \brief (FLEXCOM1  ) Base Address */
#define FLEXCOM2               (0x40024000)                   /**< \brief (FLEXCOM2  ) Base Address */
#define FLEXCOM3               (0x40018000)                   /**< \brief (FLEXCOM3  ) Base Address */
#define FLEXCOM4               (0x4001C000)                   /**< \brief (FLEXCOM4  ) Base Address */
#define FLEXCOM5               (0x40008000)                   /**< \brief (FLEXCOM5  ) Base Address */
#define FLEXCOM6               (0x40040000)                   /**< \brief (FLEXCOM6  ) Base Address */
#define FLEXCOM7               (0x40034000)                   /**< \brief (FLEXCOM7  ) Base Address */
#define GPBR                   (0x400E1490)                   /**< \brief (GPBR      ) Base Address */
#define I2SC0                  (0x40000000)                   /**< \brief (I2SC0     ) Base Address */
#define I2SC1                  (0x40004000)                   /**< \brief (I2SC1     ) Base Address */
#define MATRIX                 (0x400E0200)                   /**< \brief (MATRIX    ) Base Address */
#define MEM2MEM                (0x40028000)                   /**< \brief (MEM2MEM   ) Base Address */
#define PDMIC0                 (0x4002C000)                   /**< \brief (PDMIC0    ) Base Address */
#define PDMIC1                 (0x40030000)                   /**< \brief (PDMIC1    ) Base Address */
#define PIOA                   (0x400E0E00)                   /**< \brief (PIOA      ) Base Address */
#define PIOB                   (0x400E1000)                   /**< \brief (PIOB      ) Base Address */
#define PMC                    (0x400E0400)                   /**< \brief (PMC       ) Base Address */
#define RSTC                   (0x400E1400)                   /**< \brief (RSTC      ) Base Address */
#define RTC                    (0x400E1460)                   /**< \brief (RTC       ) Base Address */
#define RTT                    (0x400E1430)                   /**< \brief (RTT       ) Base Address */
#define SPI0                   (0x4000C400)                   /**< \brief (SPI0      ) Base Address */
#define SPI1                   (0x40020400)                   /**< \brief (SPI1      ) Base Address */
#define SPI2                   (0x40024400)                   /**< \brief (SPI2      ) Base Address */
#define SPI3                   (0x40018400)                   /**< \brief (SPI3      ) Base Address */
#define SPI4                   (0x4001C400)                   /**< \brief (SPI4      ) Base Address */
#define SPI5                   (0x40008400)                   /**< \brief (SPI5      ) Base Address */
#define SPI6                   (0x40040400)                   /**< \brief (SPI6      ) Base Address */
#define SPI7                   (0x40034400)                   /**< \brief (SPI7      ) Base Address */
#define SUPC                   (0x400E1410)                   /**< \brief (SUPC      ) Base Address */
#define TC0                    (0x40010000)                   /**< \brief (TC0       ) Base Address */
#define TC1                    (0x40014000)                   /**< \brief (TC1       ) Base Address */
#define TWI0                   (0x4000C600)                   /**< \brief (TWI0      ) Base Address */
#define TWI1                   (0x40020600)                   /**< \brief (TWI1      ) Base Address */
#define TWI2                   (0x40024600)                   /**< \brief (TWI2      ) Base Address */
#define TWI3                   (0x40018600)                   /**< \brief (TWI3      ) Base Address */
#define TWI4                   (0x4001C600)                   /**< \brief (TWI4      ) Base Address */
#define TWI5                   (0x40008600)                   /**< \brief (TWI5      ) Base Address */
#define TWI6                   (0x40040600)                   /**< \brief (TWI6      ) Base Address */
#define TWI7                   (0x40034600)                   /**< \brief (TWI7      ) Base Address */
#define UDP                    (0x40044000)                   /**< \brief (UDP       ) Base Address */
#define UHP                    (0x4004C000)                   /**< \brief (UHP       ) Base Address */
#define USART0                 (0x4000C200)                   /**< \brief (USART0    ) Base Address */
#define USART1                 (0x40020200)                   /**< \brief (USART1    ) Base Address */
#define USART2                 (0x40024200)                   /**< \brief (USART2    ) Base Address */
#define USART3                 (0x40018200)                   /**< \brief (USART3    ) Base Address */
#define USART4                 (0x4001C200)                   /**< \brief (USART4    ) Base Address */
#define USART5                 (0x40008200)                   /**< \brief (USART5    ) Base Address */
#define USART6                 (0x40040200)                   /**< \brief (USART6    ) Base Address */
#define USART7                 (0x40034200)                   /**< \brief (USART7    ) Base Address */
#define WDT                    (0x400E1450)                   /**< \brief (WDT       ) Base Address */

#else /* For C/C++ compiler */

