MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMG55J19B/mcu.h
#define ADC                    ((Adc *)0x40038000U)           /**< \brief (ADC       ) Base Address */
#define ADC_INST_NUM           1                              /**< \brief (ADC       ) Number of instances */
#define ADC_INSTS              { ADC }                        /**< \brief (ADC       ) Instances List */

#define CHIPID                 ((Chipid *)0x400E0740U)        /**< \brief (CHIPID    ) Base Address */
#define CHIPID_INST_NUM        1                              /**< \brief (CHIPID    ) Number of instances */
#define CHIPID_INSTS           { CHIPID }                     /**< \brief (CHIPID    ) Instances List */

#define CMCC                   ((Cmcc *)0x4003C000U)          /**< \brief (CMCC      ) Base Address */
#define CMCC_INST_NUM          1                              /**< \brief (CMCC      ) Number of instances */
#define CMCC_INSTS             { CMCC }                       /**< \brief (CMCC      ) Instances List */

#define CRCCU                  ((Crccu *)0x40048000U)         /**< \brief (CRCCU     ) Base Address */
#define CRCCU_INST_NUM         1                              /**< \brief (CRCCU     ) Number of instances */
#define CRCCU_INSTS            { CRCCU }                      /**< \brief (CRCCU     ) Instances List */

#define EFC                    ((Efc *)0x400E0A00U)           /**< \brief (EFC       ) Base Address */
#define EFC_INST_NUM           1                              /**< \brief (EFC       ) Number of instances */
#define EFC_INSTS              { EFC }                        /**< \brief (EFC       ) Instances List */

#define FLEXCOM0               ((Flexcom *)0x4000C000U)       /**< \brief (FLEXCOM0  ) Base Address */
#define FLEXCOM1               ((Flexcom *)0x40020000U)       /**< \brief (FLEXCOM1  ) Base Address */
#define FLEXCOM2               ((Flexcom *)0x40024000U)       /**< \brief (FLEXCOM2  ) Base Address */
#define FLEXCOM3               ((Flexcom *)0x40018000U)       /**< \brief (FLEXCOM3  ) Base Address */
#define FLEXCOM4               ((Flexcom *)0x4001C000U)       /**< \brief (FLEXCOM4  ) Base Address */
#define FLEXCOM5               ((Flexcom *)0x40008000U)       /**< \brief (FLEXCOM5  ) Base Address */
#define FLEXCOM6               ((Flexcom *)0x40040000U)       /**< \brief (FLEXCOM6  ) Base Address */
#define FLEXCOM7               ((Flexcom *)0x40034000U)       /**< \brief (FLEXCOM7  ) Base Address */
#define FLEXCOM_INST_NUM       8                              /**< \brief (FLEXCOM   ) Number of instances */
#define FLEXCOM_INSTS          { FLEXCOM0, FLEXCOM1, FLEXCOM2, FLEXCOM3, FLEXCOM4, FLEXCOM5, FLEXCOM6, FLEXCOM7 } /**< \brief (FLEXCOM   ) Instances List */

#define GPBR                   ((Gpbr *)0x400E1490U)          /**< \brief (GPBR      ) Base Address */
#define GPBR_INST_NUM          1                              /**< \brief (GPBR      ) Number of instances */
#define GPBR_INSTS             { GPBR }                       /**< \brief (GPBR      ) Instances List */

#define I2SC0                  ((I2sc *)0x40000000U)          /**< \brief (I2SC0     ) Base Address */
#define I2SC1                  ((I2sc *)0x40004000U)          /**< \brief (I2SC1     ) Base Address */
#define I2SC_INST_NUM          2                              /**< \brief (I2SC      ) Number of instances */
#define I2SC_INSTS             { I2SC0, I2SC1 }               /**< \brief (I2SC      ) Instances List */

#define MATRIX                 ((Matrix *)0x400E0200U)        /**< \brief (MATRIX    ) Base Address */
#define MATRIX_INST_NUM        1                              /**< \brief (MATRIX    ) Number of instances */
#define MATRIX_INSTS           { MATRIX }                     /**< \brief (MATRIX    ) Instances List */

#define MEM2MEM                ((Mem2mem *)0x40028000U)       /**< \brief (MEM2MEM   ) Base Address */
#define MEM2MEM_INST_NUM       1                              /**< \brief (MEM2MEM   ) Number of instances */
#define MEM2MEM_INSTS          { MEM2MEM }                    /**< \brief (MEM2MEM   ) Instances List */

#define PDMIC0                 ((Pdmic *)0x4002C000U)         /**< \brief (PDMIC0    ) Base Address */
#define PDMIC1                 ((Pdmic *)0x40030000U)         /**< \brief (PDMIC1    ) Base Address */
#define PDMIC_INST_NUM         2                              /**< \brief (PDMIC     ) Number of instances */
#define PDMIC_INSTS            { PDMIC0, PDMIC1 }             /**< \brief (PDMIC     ) Instances List */

#define PIOA                   ((Pio *)0x400E0E00U)           /**< \brief (PIOA      ) Base Address */
#define PIOB                   ((Pio *)0x400E1000U)           /**< \brief (PIOB      ) Base Address */
#define PIO_INST_NUM           2                              /**< \brief (PIO       ) Number of instances */
#define PIO_INSTS              { PIOA, PIOB }                 /**< \brief (PIO       ) Instances List */

#define PMC                    ((Pmc *)0x400E0400U)           /**< \brief (PMC       ) Base Address */
#define PMC_INST_NUM           1                              /**< \brief (PMC       ) Number of instances */
#define PMC_INSTS              { PMC }                        /**< \brief (PMC       ) Instances List */

#define RSTC                   ((Rstc *)0x400E1400U)          /**< \brief (RSTC      ) Base Address */
#define RSTC_INST_NUM          1                              /**< \brief (RSTC      ) Number of instances */
#define RSTC_INSTS             { RSTC }                       /**< \brief (RSTC      ) Instances List */

#define RTC                    ((Rtc *)0x400E1460U)           /**< \brief (RTC       ) Base Address */
#define RTC_INST_NUM           1                              /**< \brief (RTC       ) Number of instances */
#define RTC_INSTS              { RTC }                        /**< \brief (RTC       ) Instances List */

#define RTT                    ((Rtt *)0x400E1430U)           /**< \brief (RTT       ) Base Address */
#define RTT_INST_NUM           1                              /**< \brief (RTT       ) Number of instances */
#define RTT_INSTS              { RTT }                        /**< \brief (RTT       ) Instances List */

#define SPI0                   ((Spi *)0x4000C400U)           /**< \brief (SPI0      ) Base Address */
#define SPI1                   ((Spi *)0x40020400U)           /**< \brief (SPI1      ) Base Address */
#define SPI2                   ((Spi *)0x40024400U)           /**< \brief (SPI2      ) Base Address */
#define SPI3                   ((Spi *)0x40018400U)           /**< \brief (SPI3      ) Base Address */
#define SPI4                   ((Spi *)0x4001C400U)           /**< \brief (SPI4      ) Base Address */
#define SPI5                   ((Spi *)0x40008400U)           /**< \brief (SPI5      ) Base Address */
#define SPI6                   ((Spi *)0x40040400U)           /**< \brief (SPI6      ) Base Address */
#define SPI7                   ((Spi *)0x40034400U)           /**< \brief (SPI7      ) Base Address */
#define SPI_INST_NUM           8                              /**< \brief (SPI       ) Number of instances */
#define SPI_INSTS              { SPI0, SPI1, SPI2, SPI3, SPI4, SPI5, SPI6, SPI7 } /**< \brief (SPI       ) Instances List */

#define SUPC                   ((Supc *)0x400E1410U)          /**< \brief (SUPC      ) Base Address */
#define SUPC_INST_NUM          1                              /**< \brief (SUPC      ) Number of instances */
#define SUPC_INSTS             { SUPC }                       /**< \brief (SUPC      ) Instances List */

