MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMG55J19B/mcu.h
#define TC0                    ((Tc *)0x40010000U)            /**< \brief (TC0       ) Base Address */
#define TC1                    ((Tc *)0x40014000U)            /**< \brief (TC1       ) Base Address */
#define TC_INST_NUM            2                              /**< \brief (TC        ) Number of instances */
#define TC_INSTS               { TC0, TC1 }                   /**< \brief (TC        ) Instances List */

#define TWI0                   ((Twi *)0x4000C600U)           /**< \brief (TWI0      ) Base Address */
#define TWI1                   ((Twi *)0x40020600U)           /**< \brief (TWI1      ) Base Address */
#define TWI2                   ((Twi *)0x40024600U)           /**< \brief (TWI2      ) Base Address */
#define TWI3                   ((Twi *)0x40018600U)           /**< \brief (TWI3      ) Base Address */
#define TWI4                   ((Twi *)0x4001C600U)           /**< \brief (TWI4      ) Base Address */
#define TWI5                   ((Twi *)0x40008600U)           /**< \brief (TWI5      ) Base Address */
#define TWI6                   ((Twi *)0x40040600U)           /**< \brief (TWI6      ) Base Address */
#define TWI7                   ((Twi *)0x40034600U)           /**< \brief (TWI7      ) Base Address */
#define TWI_INST_NUM           8                              /**< \brief (TWI       ) Number of instances */
#define TWI_INSTS              { TWI0, TWI1, TWI2, TWI3, TWI4, TWI5, TWI6, TWI7 } /**< \brief (TWI       ) Instances List */

#define UDP                    ((Udp *)0x40044000U)           /**< \brief (UDP       ) Base Address */
#define UDP_INST_NUM           1                              /**< \brief (UDP       ) Number of instances */
#define UDP_INSTS              { UDP }                        /**< \brief (UDP       ) Instances List */

#define UHP                    ((Uhp *)0x4004C000U)           /**< \brief (UHP       ) Base Address */
#define UHP_INST_NUM           1                              /**< \brief (UHP       ) Number of instances */
#define UHP_INSTS              { UHP }                        /**< \brief (UHP       ) Instances List */

#define USART0                 ((Usart *)0x4000C200U)         /**< \brief (USART0    ) Base Address */
#define USART1                 ((Usart *)0x40020200U)         /**< \brief (USART1    ) Base Address */
#define USART2                 ((Usart *)0x40024200U)         /**< \brief (USART2    ) Base Address */
#define USART3                 ((Usart *)0x40018200U)         /**< \brief (USART3    ) Base Address */
#define USART4                 ((Usart *)0x4001C200U)         /**< \brief (USART4    ) Base Address */
#define USART5                 ((Usart *)0x40008200U)         /**< \brief (USART5    ) Base Address */
#define USART6                 ((Usart *)0x40040200U)         /**< \brief (USART6    ) Base Address */
#define USART7                 ((Usart *)0x40034200U)         /**< \brief (USART7    ) Base Address */
#define USART_INST_NUM         8                              /**< \brief (USART     ) Number of instances */
#define USART_INSTS            { USART0, USART1, USART2, USART3, USART4, USART5, USART6, USART7 } /**< \brief (USART     ) Instances List */

#define WDT                    ((Wdt *)0x400E1450U)           /**< \brief (WDT       ) Base Address */
#define WDT_INST_NUM           1                              /**< \brief (WDT       ) Number of instances */
#define WDT_INSTS              { WDT }                        /**< \brief (WDT       ) Instances List */

#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup SAMG55J19_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAMG55J19*/
/* ************************************************************************** */
#include "pio/samg55j19.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAMG55J19*/
/* ************************************************************************** */

#define PERIPHERALS_SIZE         _U_(0x20000000)       /* 524288kB Memory segment type: io */
#define SYSTEM_SIZE              _U_(0x10000000)       /* 262144kB Memory segment type: io */
#define IFLASH_SIZE              _U_(0x00080000)       /*  512kB Memory segment type: flash */
#define IFLASH_PAGE_SIZE         _U_(       512)
#define IFLASH_NB_OF_PAGES       _U_(      1024)

#define IROM_SIZE                _U_(0x00400000)       /* 4096kB Memory segment type: rom */
#define IRAM_SIZE                _U_(0x00028000)       /*  160kB Memory segment type: ram */
#define CMCC_SIZE                _U_(0x00004000)       /*   16kB Memory segment type: other */

#define PERIPHERALS_ADDR         _U_(0x40000000)       /**< PERIPHERALS base address (type: io)*/
#define SYSTEM_ADDR              _U_(0xe0000000)       /**< SYSTEM base address (type: io)*/
#define IFLASH_ADDR              _U_(0x00400000)       /**< IFLASH base address (type: flash)*/
#define IROM_ADDR                _U_(0x00800000)       /**< IROM base address (type: rom)*/
#define IRAM_ADDR                _U_(0x20000000)       /**< IRAM base address (type: ram)*/
#define CMCC_ADDR                _U_(0x1fc00000)       /**< CMCC base address (type: other)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR SAMG55J19 */
/* ************************************************************************** */
#define JTAGID                   _UL_(0X05B3E03F)
#define CHIP_JTAGID              _UL_(0X05B3E03F)
#define CHIP_CIDR                _UL_(0X24570AE0)
#define CHIP_EXID                _UL_(0X00000000)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR SAMG55J19 */
/* ************************************************************************** */
#define CHIP_FREQ_SLCK_RC_MIN          _UL_(20000)     
#define CHIP_FREQ_SLCK_RC              _UL_(32000)     /**< \brief Typical Slow Clock Internal RC frequency*/
#define CHIP_FREQ_SLCK_RC_MAX          _UL_(44000)     
#define CHIP_FREQ_MAINCK_RC_8MHZ       _UL_(8000000)   
#define CHIP_FREQ_MAINCK_RC_16MHZ      _UL_(16000000)  
#define CHIP_FREQ_MAINCK_RC_24MHZ      _UL_(24000000)  
#define CHIP_FREQ_CPU_MAX              _UL_(120000000) 
#define CHIP_FREQ_XTAL_32K             _UL_(32768)     
#define CHIP_FLASH_WRITE_WAIT_STATE    _UL_(8)         /**< \brief Embedded Flash Write Wait State*/
#define CHIP_FREQ_FWS_0                _UL_(14000000)  /**< \brief Maximum operating frequency when FWS is 0*/
#define CHIP_FREQ_FWS_1                _UL_(28000000)  /**< \brief Maximum operating frequency when FWS is 1*/
#define CHIP_FREQ_FWS_2                _UL_(42000000)  /**< \brief Maximum operating frequency when FWS is 2*/
#define CHIP_FREQ_FWS_3                _UL_(56000000)  /**< \brief Maximum operating frequency when FWS is 3*/
#define CHIP_FREQ_FWS_4                _UL_(70000000)  /**< \brief Maximum operating frequency when FWS is 4*/
#define CHIP_FREQ_FWS_5                _UL_(84000000)  /**< \brief Maximum operating frequency when FWS is 5*/
#define CHIP_FREQ_FWS_6                _UL_(96000000)  /**< \brief Maximum operating frequency when FWS is 6*/
#define CHIP_FREQ_FWS_7                _UL_(108000000) /**< \brief Maximum operating frequency when FWS is 7*/
#define CHIP_FREQ_FWS_8                _UL_(120000000) /**< \brief Maximum operating frequency when FWS is 8*/
#define CHIP_FREQ_FWS_NUMBER           _UL_(9)         /**< \brief Number of FWS ranges*/

#ifdef __cplusplus
}
#endif

/** @}  end of SAMG55J19 definitions */


#endif /* _SAMG55J19_H_ */
